In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
sales_funnel = pd.read_excel('data-files/b.sales-funnel.xlsx')
sales_funnel.head()

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won

In [3]:
pd.pivot_table(sales_funnel, index=['Name']) # 컬럼과 열을 재구성 #index를 name으로 잡고, 숫자로 된 것들만 가져옴

                              Account   Price  Quantity
Name
Barton LLC                     740150   35000  1.000000
Fritsch, Russel and Anderson   737550   35000  1.000000
Herman LLC                     141962   65000  2.000000
Jerde-Hilpert                  412290    5000  2.000000
Kassulke, Ondricka and Metz    307599    7000  3.000000
Keeling LLC                    688981  100000  5.000000
Kiehn-Spinka                   146832   65000  2.000000
Koepp Ltd                      729833   35000  2.000000
Kulas Inc                      218895   25000  1.500000
Purdy-Kunde                    163416   30000  1.000000
Stokes LLC                     239344    7500  1.000000
Trantow-Barrows                714466   15000  1.333333

In [4]:
pd.pivot_table(sales_funnel, index=['Name','Rep', 'Manager'])

,,,Account,Price,Quantity
Name,Rep,Manager,,,
Barton LLC,John Smith,Debra Henley,740150,35000,1.000000
"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,737550,35000,1.000000
Herman LLC,Cedric Moss,Fred Anderson,141962,65000,2.000000
Jerde-Hilpert,John Smith,Debra Henley,412290,5000,2.000000
"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,307599,7000,3.000000
Keeling LLC,Wendy Yule,Fred Anderson,688981,100000,5.000000
Kiehn-Spinka,Daniel Hilton,Debra Henley,146832,65000,2.000000
Koepp Ltd,Wendy Yule,Fred Anderson,729833,35000,2.000000
Kulas Inc,Daniel Hilton,Debra Henley,218895,25000,1.500000
Purdy-Kunde,Cedric Moss,Fred Anderson,163416,30000,1.000000
Stokes LLC,Cedric Moss,Fred Anderson,239344,7500,1.000000
Trantow-Barrows,Craig Booker,Debra Henley,714466,15000,1.333333

In [5]:
pd.pivot_table(sales_funnel, index=['Manager','Rep'])

                              Account         Price  Quantity
Manager       Rep
Debra Henley  Craig Booker   720237.0  20000.000000  1.250000
              Daniel Hilton  194874.0  38333.333333  1.666667
              John Smith     576220.0  20000.000000  1.500000
Fred Anderson Cedric Moss    196016.5  27500.000000  1.250000
              Wendy Yule     614061.5  44250.000000  3.000000

In [6]:
pd.pivot_table(sales_funnel,index=['Manager','Rep'], values=['Price']) # Price만 보고싶당

                                    Price
Manager       Rep
Debra Henley  Craig Booker   20000.000000
              Daniel Hilton  38333.333333
              John Smith     20000.000000
Fred Anderson Cedric Moss    27500.000000
              Wendy Yule     44250.000000

In [7]:
pd.pivot_table(sales_funnel,index=['Manager','Rep'], values=['Price'], aggfunc=[np.sum,len]) # 평균이 아닌 sum과 length

                                sum   len
                              Price Price
Manager       Rep
Debra Henley  Craig Booker    80000     4
              Daniel Hilton  115000     3
              John Smith      40000     2
Fred Anderson Cedric Moss    110000     4
              Wendy Yule     177000     4

In [8]:
pd.pivot_table(sales_funnel,index=['Manager','Rep'], columns=['Product'],values=['Price'], aggfunc=[np.sum])

                                  sum
                                Price
Product                           CPU Maintenance Monitor Software
Manager       Rep
Debra Henley  Craig Booker    65000.0      5000.0     NaN  10000.0
              Daniel Hilton  105000.0         NaN     NaN  10000.0
              John Smith      35000.0      5000.0     NaN      NaN
Fred Anderson Cedric Moss     95000.0      5000.0     NaN  10000.0
              Wendy Yule     165000.0      7000.0  5000.0      NaN

In [9]:
pd.pivot_table(sales_funnel,index=['Manager','Rep'], columns=['Product'],values=['Price'], aggfunc=[np.sum], fill_value=0) # NaN 0으로

                                sum
                              Price
Product                         CPU Maintenance Monitor Software
Manager       Rep
Debra Henley  Craig Booker    65000        5000       0    10000
              Daniel Hilton  105000           0       0    10000
              John Smith      35000        5000       0        0
Fred Anderson Cedric Moss     95000        5000       0    10000
              Wendy Yule     165000        7000    5000        0

In [10]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [11]:
crime_in_seoul = pd.read_csv('data-files/b.crime-in-seoul_include_gu_name.csv', thousands=',')
crime_in_seoul_backup = crime_in_seoul.copy()

In [12]:
crime_in_seoul.head()

,관서명,살인 발생,살인 검거,강도 발생,강도 검거,강간 발생,강간 검거,절도 발생,절도 검거,폭력 발생,폭력 검거,구별
0,중부서,2,2,3,2,105,65,1395,477,1355,1170,중구
1,종로서,3,3,6,5,115,98,1070,413,1278,1070,종로구
2,남대문서,1,0,6,4,65,46,1153,382,869,794,중구
3,서대문서,2,2,5,4,154,124,1812,738,2056,1711,서대문구
4,혜화서,3,2,5,4,96,63,1114,424,1015,861,종로구

In [13]:
crime_in_seoul = pd.pivot_table(crime_in_seoul, index=['구별'], aggfunc=np.sum)

In [14]:
crime_in_seoul.head()

     강간 검거  강간 발생  강도 검거  강도 발생  살인 검거  살인 발생  절도 검거  절도 발생  폭력 검거  폭력 발생
구별
강남구    349    449     18     21     10     13   1650   3850   3705   4284
강동구    123    156      8      6      3      4    789   2366   2248   2712
강북구    126    153     13     14      8      7    618   1434   2348   2649
강서구    191    262     13     13      8      7   1260   2096   2718   3207
관악구    221    320     14     12      8      9    827   2706   2642   3298

In [15]:
# crime_in_seoul_backup.set_index(['구별']).sort_index()

In [16]:
crime_in_seoul.sort_values(['강간 발생'], ascending=False).head(3)
crime_in_seoul.sort_values(['강도 발생'], ascending=False).head(3)
crime_in_seoul.sort_values(['살인 발생'], ascending=False).head(3)
crime_in_seoul.sort_values(['절도 발생'], ascending=False).head(3)
crime_in_seoul.sort_values(['폭력 발생'], ascending=False).head(3)

      강간 검거  강간 발생  강도 검거  강도 발생  살인 검거  살인 발생  절도 검거  절도 발생  폭력 검거  폭력 발생
구별
강남구     349    449     18     21     10     13   1650   3850   3705   4284
영등포구    183    295     20     22     12     14    978   2964   2961   3572
관악구     221    320     14     12      8      9    827   2706   2642   3298

In [17]:
crime_in_seoul['강간검거율'] = crime_in_seoul['강간 검거'] / crime_in_seoul['강간 발생']
crime_in_seoul['강도검거율'] = crime_in_seoul['강도 검거'] / crime_in_seoul['강도 발생']
crime_in_seoul['살인검거율'] = crime_in_seoul['살인 검거'] / crime_in_seoul['살인 발생']
crime_in_seoul['절도검거율'] = crime_in_seoul['절도 검거'] / crime_in_seoul['절도 발생']
crime_in_seoul['폭력검거율'] = crime_in_seoul['폭력 검거'] / crime_in_seoul['폭력 발생']

In [18]:
crime_in_seoul.head(3)

,강간 검거,강간 발생,강도 검거,강도 발생,살인 검거,살인 발생,절도 검거,절도 발생,폭력 검거,폭력 발생,강간검거율,강도검거율,살인검거율,절도검거율,폭력검거율
구별,,,,,,,,,,,,,,,
강남구,349,449,18,21,10,13,1650,3850,3705,4284,0.777283,0.857143,0.769231,0.428571,0.864846
강동구,123,156,8,6,3,4,789,2366,2248,2712,0.788462,1.333333,0.750000,0.333474,0.828909
강북구,126,153,13,14,8,7,618,1434,2348,2649,0.823529,0.928571,1.142857,0.430962,0.886372

In [19]:
crime_in_seoul.drop(crime_in_seoul.columns[0:9:2], axis=1, inplace=True) # 0~ 9 2 차이 -> 0 2 4 6 8

In [20]:
crime_in_seoul.head(3)

,강간 발생,강도 발생,살인 발생,절도 발생,폭력 발생,강간검거율,강도검거율,살인검거율,절도검거율,폭력검거율
구별,,,,,,,,,,
강남구,449,21,13,3850,4284,0.777283,0.857143,0.769231,0.428571,0.864846
강동구,156,6,4,2366,2712,0.788462,1.333333,0.750000,0.333474,0.828909
강북구,153,14,7,1434,2649,0.823529,0.928571,1.142857,0.430962,0.886372

In [21]:
# crime_in_seoul["강간검거율"].sort_values(ascending=False)
# crime_in_seoul["강도검거율"].sort_values(ascending=False)
# crime_in_seoul["살인검거율"].sort_values(ascending=False)
# crime_in_seoul["절도검거율"].sort_values(ascending=False)
# crime_in_seoul["폭력검거율"].sort_values(ascending=False)

In [22]:
for column in crime_in_seoul.columns:
    if "검거율" in column:
        crime_in_seoul.loc[crime_in_seoul[column] > 1, column] = 1

In [23]:
crime_in_seoul.head(3)

,강간 발생,강도 발생,살인 발생,절도 발생,폭력 발생,강간검거율,강도검거율,살인검거율,절도검거율,폭력검거율
구별,,,,,,,,,,
강남구,449,21,13,3850,4284,0.777283,0.857143,0.769231,0.428571,0.864846
강동구,156,6,4,2366,2712,0.788462,1.000000,0.750000,0.333474,0.828909
강북구,153,14,7,1434,2649,0.823529,0.928571,1.000000,0.430962,0.886372

In [24]:
crime_in_seoul.rename(columns={'강간 발생':'강간', '강도 발생':'강도', '살인 발생':'살인','절도 발생':'절도','폭력 발생':'폭력'}, inplace=True)

In [25]:
crime_in_seoul.head(3)

      강간  강도  살인    절도    폭력     강간검거율     강도검거율     살인검거율     절도검거율     폭력검거율
구별
강남구  449  21  13  3850  4284  0.777283  0.857143  0.769231  0.428571  0.864846
강동구  156   6   4  2366  2712  0.788462  1.000000  0.750000  0.333474  0.828909
강북구  153  14   7  1434  2649  0.823529  0.928571  1.000000  0.430962  0.886372

In [26]:
mx = crime_in_seoul['강간'].max()
mn = crime_in_seoul['강간'].min()
(crime_in_seoul['강간'] - mn )/ (mx - mn)

구별
강남구     1.000000
강동구     0.155620
강북구     0.146974
강서구     0.461095
관악구     0.628242
광진구     0.397695
구로구     0.515850
금천구     0.141210
노원구     0.273775
도봉구     0.000000
동대문구    0.204611
동작구     0.527378
마포구     0.553314
서대문구    0.149856
서초구     0.838617
성동구     0.069164
성북구     0.138329
송파구     0.340058
양천구     0.051873
영등포구    0.556196
용산구     0.265130
은평구     0.184438
종로구     0.314121
중구      0.195965
중랑구     0.244957
Name: 강간, dtype: float64

In [27]:
for idx in range(5):
    s = crime_in_seoul.iloc[:, idx]
    mx = s.max()
    mn = s.min()
    crime_in_seoul.iloc[:, idx] = (s - mn) / (mx - mn)

In [28]:
crime_in_seoul.head(3)

,강간,강도,살인,절도,폭력,강간검거율,강도검거율,살인검거율,절도검거율,폭력검거율
구별,,,,,,,,,,
강남구,1.000000,0.941176,0.916667,1.000000,1.000000,0.777283,0.857143,0.769231,0.428571,0.864846
강동구,0.155620,0.058824,0.166667,0.467528,0.437969,0.788462,1.000000,0.750000,0.333474,0.828909
강북구,0.146974,0.529412,0.416667,0.133118,0.415445,0.823529,0.928571,1.000000,0.430962,0.886372

In [29]:
# pd.read_csv('data-files/a.cctv-in-seoul.csv', encoding='utf-8')
# pd.read_excel('data-files/a.population-in-seoul.xls')
pd.read_csv('data-files/a.cctv-in-seoul.csv', encoding='utf-8')
# pd.read_excel('data-files/a.population-in-seoul.xls')
cctv = pd.read_csv('data-files/a.cctv-result.csv', encoding='utf-8', index_col='구별') #index 구별로 맞춰야 한다.
cctv.head()

,소계,최근증가율,인구수,한국인,외국인,고령자,외국인비율,고령자비율,CCTV비율,오차
구별,,,,,,,,,,
강남구,2780,150.619195,570500.0,565550.0,4950.0,63167.0,0.867660,11.072217,0.487292,1388.055355
강동구,773,166.490765,453233.0,449019.0,4214.0,54622.0,0.929765,12.051638,0.170552,465.422892
강북구,748,125.203252,330192.0,326686.0,3506.0,54813.0,1.061806,16.600342,0.226535,329.342026
강서구,884,134.793814,603772.0,597248.0,6524.0,72548.0,1.080540,12.015794,0.146413,551.503155
관악구,1496,149.290780,525515.0,507203.0,18312.0,68082.0,3.484582,12.955291,0.284673,162.948104

In [30]:
crime_in_seoul[['인구수','CCTV']] = cctv[['인구수', '소계']]  #인구수, cctv로 colname 바꾸기

In [31]:
crime_in_seoul.head()

,강간,강도,살인,절도,폭력,강간검거율,강도검거율,살인검거율,절도검거율,폭력검거율,인구수,CCTV
구별,,,,,,,,,,,,
강남구,1.000000,0.941176,0.916667,1.000000,1.000000,0.777283,0.857143,0.769231,0.428571,0.864846,570500.0,2780
강동구,0.155620,0.058824,0.166667,0.467528,0.437969,0.788462,1.000000,0.750000,0.333474,0.828909,453233.0,773
강북구,0.146974,0.529412,0.416667,0.133118,0.415445,0.823529,0.928571,1.000000,0.430962,0.886372,330192.0,748
강서구,0.461095,0.470588,0.416667,0.370649,0.614945,0.729008,1.000000,1.000000,0.601145,0.847521,603772.0,884
관악구,0.628242,0.411765,0.583333,0.589523,0.647479,0.690625,1.000000,0.888889,0.305617,0.801092,525515.0,1496

In [32]:
crime_in_seoul['범죄'] = crime_in_seoul.iloc[:,:5].sum(axis=1)
crime_in_seoul['검거'] = crime_in_seoul.iloc[:,5:10].sum(axis=1)

In [33]:
crime_in_seoul.head()

,강간,강도,살인,절도,폭력,강간검거율,강도검거율,살인검거율,절도검거율,폭력검거율,인구수,CCTV,범죄,검거
구별,,,,,,,,,,,,,,
강남구,1.000000,0.941176,0.916667,1.000000,1.000000,0.777283,0.857143,0.769231,0.428571,0.864846,570500.0,2780,4.857843,3.697074
강동구,0.155620,0.058824,0.166667,0.467528,0.437969,0.788462,1.000000,0.750000,0.333474,0.828909,453233.0,773,1.286607,3.700844
강북구,0.146974,0.529412,0.416667,0.133118,0.415445,0.823529,0.928571,1.000000,0.430962,0.886372,330192.0,748,1.641616,4.069435
강서구,0.461095,0.470588,0.416667,0.370649,0.614945,0.729008,1.000000,1.000000,0.601145,0.847521,603772.0,884,2.333944,4.177674
관악구,0.628242,0.411765,0.583333,0.589523,0.647479,0.690625,1.000000,0.888889,0.305617,0.801092,525515.0,1496,2.860342,3.686223

In [34]:
# (crime_in_seoul['인구수'] / crime_in_seoul['범죄']).sort_values(ascending=False)
# print(crime_in_seoul['범죄'].sort_values(ascending=False))
# print(crime_in_seoul['CCTV'].sort_values(ascending=False))

In [35]:
# crime_in_seoul[['범죄','CCTV']].head()
crime_in_seoul[['범죄','CCTV']].head()
crime_in_seoul[['범죄','CCTV', '인구수']].corr() # 상관계수: -1 ~ 1의 값 # 둘의 인과관계가 아닌, 범죄가 올라가면 cctv도 올라가는가? 의 질문임. 같은 변화의 이유가 제 3의 요인때문일 수도 있음

            범죄      CCTV       인구수
범죄    1.000000  0.286454  0.469980
CCTV  0.286454  1.000000  0.306342
인구수   0.469980  0.306342  1.000000

In [37]:
crime_in_seoul.to_csv('data-files/b.normed-crime-in-seoul.csv', encoding='utf-8')